In [1]:
from IPython.display import display, HTML
display(HTML("""<style>
div.container{width:86% !important;}
div.cell.code_cell.rendered{width:100%;}
div.CodeMirror {font-family:Consolas; font-size:12pt;}
div.output {font-size:12pt; font-weight:bold;}
div.input {font-family:Consolas; font-size:12pt;}
div.prompt {min-width:70px;}
div#toc-wrapper{padding-top:120px;}
div.text_cell_render ul li{fontsize:12pt;padding:5px;}
table.dataframe{font-size:12px;}))
</style>
"""))

<font size="5" color="red">ch11 데이터프레임과 시리즈(Pandas)</font>

- pip install pandas / conda install pandas (아나콘다 프롬프트)

# 1절. 판다스 패키지

- 데이터 분석을 위해 반드시 알아야 할 패키지. 넘파이 기반으로 다른 많은 라이브러리와 잘 통합되도록 설계
- 1차원 구조를 갖는 시리즈, 2차원 구조를 갖는 데이터프레임(excel의 스프레드시트)을 제공
- 판다스 장점 : 파일io, 부분 데이터 추출, 크기변경, 데이터 분할, 병합, 정렬, 결측치 처리, 피벗과 언피벗(와이드포멧과 통포멧)에 용이
- [Pandas API reference](https://pandas.pydata.org/docs/reference/index.html)
- [Pandas docs](https://pandas.pydata.org/docs/index.html)

In [2]:
import pandas as pd
pd.__version__

'1.5.3'

In [6]:
data = pd.read_csv('data/ch09_member1.csv', encoding = 'utf-8')  # encoding = 'utf-8' 기본값

display(data)
type(data)

   홍길동  20  kildong@hong.com   서울시 관악구
0  김길동  40  kimdong@hong.com  서울시 영등포구
1  신길동  30  sindong@hong.com   서울시 동작구

pandas.core.frame.DataFrame

In [8]:
data = pd.read_csv('data/ch09_member1.csv',
                  header = None,
                  names = ['name', 'age', 'email', 'address'])
data.head(2)  # 최초 상위 2줄

  name  age             email   address
0  홍길동   20  kildong@hong.com   서울시 관악구
1  김길동   40  kimdong@hong.com  서울시 영등포구

In [10]:
data = pd.read_json('data/ch09_member.json', encoding = 'utf-8')
data

  name  age             email address
0  홍길동   20  kildong@hong.com      서울
1  김길동   30  kildong@hong.com      인천

In [13]:
iris = pd.read_hdf('data/ch09_iris.hdf5', key = 'iris')
iris.head()  # 상위 5개

   sepal_length  sepal_width  petal_length  petal_width species
0           5.1          3.5           1.4          0.2  setosa
1           4.9          3.0           1.4          0.2  setosa
2           4.7          3.2           1.3          0.2  setosa
3           4.6          3.1           1.5          0.2  setosa
4           5.0          3.6           1.4          0.2  setosa

# 2절. 데이터프레임 만들기

## 2.1 딕셔너리를 이용해서 데이터프레임 만들기

In [22]:
# 딕셔너리를 데이터프레임

d = {'kor':[100, 90], 'mat':[95, 90]}
df = pd.DataFrame(data = d)
df

   kor  mat
0  100   95
1   90   90

In [23]:
df.to_dict()  # 데이터프레임을 딕셔너리로 변환

{'kor': {0: 100, 1: 90}, 'mat': {0: 95, 1: 90}}

In [24]:
df.to_numpy()

array([[100,  95],
       [ 90,  90]], dtype=int64)

In [27]:
# 딕셔너리 리스트를 데이터프레임

d = [{'kor':100, 'mat':95}, {'kor':90., 'mat':90}]
df = pd.DataFrame(data = d)
df

     kor  mat
0  100.0   95
1   90.0   90

In [28]:
df.dtypes  # 잘 안씀

kor    float64
mat      int64
dtype: object

In [29]:
df.info()  # 많이 쓰임

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 2 entries, 0 to 1
Data columns (total 2 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   kor     2 non-null      float64
 1   mat     2 non-null      int64
dtypes: float64(1), int64(1)
memory usage: 160.0 bytes

In [77]:
d = [{'kor':100, 'mat':100}, {'kor':90, 'mat':91}, {'kor':93, 'math':100}]
df = pd.DataFrame(data = d)  # 결측치는 실수형(float64). 정수형 변환 불가 (결측치 대체를 한 후 정수형 변환)
df

   kor    mat   math
0  100  100.0    NaN
1   90   91.0    NaN
2   93    NaN  100.0

In [37]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3 entries, 0 to 2
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   kor     3 non-null      int64
 1   mat     2 non-null      float64
 2   math    1 non-null      float64
dtypes: float64(2), int64(1)
memory usage: 200.0 bytes

## 2.2 리스트를 이용해서 데이터프레임 만들기

In [46]:
title = ['책1', '책2', '책3']
price = [15000, 18000, 10000]
df = pd.DataFrame(data = {'title':title, 'price':price})
df

  title  price
0    책1  15000
1    책2  18000
2    책3  10000

In [47]:
import numpy as np

np.c_[title, price]

array([['책1', '15000'],
       ['책2', '18000'],
       ['책3', '10000']], dtype='<U11')

In [48]:
df = pd.DataFrame(np.c_[title, price], columns = ['책이름', '가격'])
df

  책이름     가격
0  책1  15000
1  책2  18000
2  책3  10000

In [49]:
l = [['책1', 15000],
     ['책2', 18000],
     ['책3', 10000]]
df = pd.DataFrame(l, columns = ['책이름', '가격'])
df

  책이름     가격
0  책1  15000
1  책2  18000
2  책3  10000

## 2.3 read_csv

In [53]:
%ls C:\ai_x\download\shareData\상가정보\

 C 드라이브의 볼륨에는 이름이 없습니다.
 볼륨 일련 번호: 3664-591E

 C:\ai_x\download\shareData\상가정보 디렉터리

2025-04-28  오후 03:52    <DIR>          .
2025-04-28  오후 03:52    <DIR>          ..
2025-04-21  오후 03:13             1,011 [필독]파일열람방법.txt
2025-04-21  오후 03:21        61,227,944 소상공인시장진흥공단_상가(상권)정보_강원_202503.csv
2025-04-21  오후 03:21       356,572,082 소상공인시장진흥공단_상가(상권)정보_경기_202503.csv
2025-04-21  오후 03:22        93,472,559 소상공인시장진흥공단_상가(상권)정보_경남_202503.csv
2025-04-21  오후 03:22        76,425,275 소상공인시장진흥공단_상가(상권)정보_경북_202503.csv
2025-04-21  오후 03:22        40,070,868 소상공인시장진흥공단_상가(상권)정보_광주_202503.csv
2025-04-21  오후 03:22        61,715,005 소상공인시장진흥공단_상가(상권)정보_대구_202503.csv
2025-04-21  오후 03:23        41,491,092 소상공인시장진흥공단_상가(상권)정보_대전_202503.csv
2025-04-21  오후 03:23        84,550,600 소상공인시장진흥공단_상가(상권)정보_부산_202503.csv
2025-04-21  오후 03:23       294,549,483 소상공인시장진흥공단_상가(상권)정보_서울_202503.csv
2025-04-21  오후 03:23         9,303,432 소상공인시장진흥공단_상가(상권)정보_세종_202503.csv
2025-04-21  오후 03:23        28,457,489 소상공인시장진흥공단_상가(상권)정보_울산_202503.csv
2025-04-21  오후 03:23        73,022,149 소상공인시장진흥공단_상가(상권)정보_인천_202503.csv
2025-04-21  오후 03:23        52,997,974 소상공인시장진흥공단_상가(상권)정보_전남_202503.csv
2025-04-21  오후 03:24        56,252,705 소상공인시장진흥공단_상가(상권)정보_전북_202503.csv
2025-04-21  오후 03:24        32,943,677 소상공인시장진흥공단_상가(상권)정보_제주_202503.csv
2025-04-21  오후 03:24        66,591,896 소상공인시장진흥공단_상가(상권)정보_충남_202503.csv
2025-04-21  오후 03:21        50,727,673 소상공인시장진흥공단_상가(상권)정보_충북_202503.csv
              18개 파일       1,480,372,914 바이트
               2개 디렉터리  152,898,310,144 바이트 남음

In [56]:
df = pd.read_csv(r'C:\ai_x\download\shareData\상가정보\소상공인시장진흥공단_상가(상권)정보_세종_202503.csv',
                 # encoding = 'utf-8',
                 # sep = ',',
                 low_memory = False,  # 데이터 용량이 클 경우만 기입
                 nrows = 30  # 처음 30행만
                )
df.shape

(30, 39)

In [57]:
df.head(1)

,상가업소번호,상호명,지점명,상권업종대분류코드,상권업종대분류명,상권업종중분류코드,상권업종중분류명,상권업종소분류코드,상권업종소분류명,표준산업분류코드,...,건물관리번호,건물명,도로명주소,구우편번호,신우편번호,동정보,층정보,호정보,경도,위도
0,MA010120220700019175,세종수이비인후과의원,NaN,Q1,보건의료,Q102,의원,Q10201,내과/소아과 의원,Q86201,...,3611011600200050002000001,행정중심복합도시,세종특별자치시 세종특별자치시 해밀3로 43,NaN,30092,NaN,NaN,NaN,127.264487,36.528585

In [58]:
# 판다스 디스플레이 옵션

pd.options.display.max_columns = 39  # 39열까지 display가능(기본값20)
pd.options.display.max_rows = 40  # 40행까지 display가능(기본값 60)
df.head(1)

,상가업소번호,상호명,지점명,상권업종대분류코드,상권업종대분류명,상권업종중분류코드,상권업종중분류명,상권업종소분류코드,상권업종소분류명,표준산업분류코드,표준산업분류명,시도코드,시도명,시군구코드,시군구명,행정동코드,행정동명,법정동코드,법정동명,지번코드,대지구분코드,대지구분명,지번본번지,지번부번지,지번주소,도로명코드,도로명,건물본번지,건물부번지,건물관리번호,건물명,도로명주소,구우편번호,신우편번호,동정보,층정보,호정보,경도,위도
0,MA010120220700019175,세종수이비인후과의원,NaN,Q1,보건의료,Q102,의원,Q10201,내과/소아과 의원,Q86201,일반의원,36,세종특별자치시,36110,세종특별자치시,36110525,해밀동,3611011600,해밀동,3611011600200050002,2,산,5,2.0,세종특별자치시 세종특별자치시 해밀동 산5-2,361103352828,세종특별자치시 세종특별자치시 해밀3로,43,NaN,3611011600200050002000001,행정중심복합도시,세종특별자치시 세종특별자치시 해밀3로 43,NaN,30092,NaN,NaN,NaN,127.264487,36.528585

In [59]:
df.head(1).T

                                   0
상가업소번호          MA010120220700019175
상호명                       세종수이비인후과의원
지점명                              NaN
상권업종대분류코드                         Q1
상권업종대분류명                        보건의료
상권업종중분류코드                       Q102
상권업종중분류명                          의원
상권업종소분류코드                     Q10201
상권업종소분류명                   내과/소아과 의원
표준산업분류코드                      Q86201
표준산업분류명                         일반의원
시도코드                              36
시도명                          세종특별자치시
시군구코드                          36110
시군구명                         세종특별자치시
행정동코드                       36110525
행정동명                             해밀동
법정동코드                     3611011600
법정동명                             해밀동
지번코드             3611011600200050002
대지구분코드                             2
대지구분명                              산
지번본번지                              5
지번부번지                            2.0
지번주소        세종특별자치시 세종특별자치시 해밀동 산5-2
도로명코드                   361103352828
도로명             세종특별자치시 세종특별자치시 해밀3로
건물본번지                             43
건물부번지                            NaN
건물관리번호     3611011600200050002000001
건물명                         행정중심복합도시
도로명주소        세종특별자치시 세종특별자치시 해밀3로 43
구우편번호                            NaN
신우편번호                          30092
동정보                              NaN
층정보                              NaN
호정보                              NaN
경도                        127.264487
위도                         36.528585

In [69]:
# (1) CSV 파일 불러오기(기본값)
# encoding = 'utf-8', sep = ',', csv파일의 첫번째 줄을 header. #이 있는 줄도 데이터로 인식

member = pd.read_csv('data/ch11_member.csv')
member

   Name  Age          Email  Address       Birth
0   홍길동   20  hong@hong.com  서울시 강동구  1999-01-01
1   홍길서   30   seo@hong.com   서울시 중구  1999-12-01
2   홍길남   21   nam@hong.com  서울시 강동구  1999-11-01
3   홍길북   22   buk@hong.com  서울시 관악구  1999-05-01
4   홍길중   23   mid@hong.com   부산시 중구  1999-01-30
5  #홍길뜽   24    non@not.com      없는구  2000-01-01

In [70]:
member.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 6 entries, 0 to 5
Data columns (total 5 columns):
 #   Column   Non-Null Count  Dtype
---  ------   --------------  -----
 0   Name     6 non-null      object
 1   Age      6 non-null      int64
 2   Email    6 non-null      object
 3   Address  6 non-null      object
 4   Birth    6 non-null      object
dtypes: int64(1), object(4)
memory usage: 368.0+ bytes

In [71]:
# 형변환 Age열 : int64 → int16

member['Age'].astype('int')  # 'int' : np.int32
member['Age'] = member['Age'].astype(np.int16)
member.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 6 entries, 0 to 5
Data columns (total 5 columns):
 #   Column   Non-Null Count  Dtype
---  ------   --------------  -----
 0   Name     6 non-null      object
 1   Age      6 non-null      int16
 2   Email    6 non-null      object
 3   Address  6 non-null      object
 4   Birth    6 non-null      object
dtypes: int16(1), object(4)
memory usage: 332.0+ bytes

In [72]:
# 형변환 Birth열 : object → datetime64

member['Birth_as'] = member['Birth'].astype('datetime64')
member.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 6 entries, 0 to 5
Data columns (total 6 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   Name      6 non-null      object
 1   Age       6 non-null      int16
 2   Email     6 non-null      object
 3   Address   6 non-null      object
 4   Birth     6 non-null      object
 5   Birth_as  6 non-null      datetime64[ns]
dtypes: datetime64[ns](1), int16(1), object(4)
memory usage: 380.0+ bytes

In [73]:
member['Birth_to'] = pd.to_datetime(member['Birth'])  # astype()함수보다 안전한 형변환
member.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 6 entries, 0 to 5
Data columns (total 7 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   Name      6 non-null      object
 1   Age       6 non-null      int16
 2   Email     6 non-null      object
 3   Address   6 non-null      object
 4   Birth     6 non-null      object
 5   Birth_as  6 non-null      datetime64[ns]
 6   Birth_to  6 non-null      datetime64[ns]
dtypes: datetime64[ns](2), int16(1), object(4)
memory usage: 428.0+ bytes

In [74]:
# (2) 특정행 제외하고 csv파일읽기

member = pd.read_csv('data/ch11_membercp949.csv',
                    encoding='cp949',
                    skiprows=[1, 6])  # 1,6번째 행은 제외하고 읽어오기
member

  Name  Age         Email  Address       Birth
0  홍길서   30  seo@hong.com   서울시 중구  1999-12-01
1  홍길남   21  nam@hong.com  서울시 강동구  1999-11-01
2  홍길북   22  buk@hong.com  서울시 관악구  1999-05-01
3  홍길중   23  mid@hong.com   부산시 중구  1999-01-30

In [75]:
# (3) 주석(#)제외, datetime형 필드 지정하여 읽기

member = pd.read_csv('data/ch11_membertab.csv',
                     sep = '\t',
                     comment = '#',
                     parse_dates = ['Birth'])  # datetime형으로 읽어올 필드 지정
member.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5 entries, 0 to 4
Data columns (total 5 columns):
 #   Column   Non-Null Count  Dtype
---  ------   --------------  -----
 0   Name     5 non-null      object
 1   Age      5 non-null      int64
 2   Email    5 non-null      object
 3   Address  5 non-null      object
 4   Birth    5 non-null      datetime64[ns]
dtypes: datetime64[ns](1), int64(1), object(3)
memory usage: 328.0+ bytes

In [76]:
# (4) sep = '|', 상위 n행만 읽어오기

member = pd.read_csv('data/ch11_membersep.csv',
                     sep = '|',
                     nrows = 5)
member

  Name  Age          Email  Address       Birth
0  홍길동   20  hong@hong.com  서울시 강동구  1999-01-01
1  홍길서   30   seo@hong.com   서울시 중구  1999-12-01
2  홍길남   21   nam@hong.com  서울시 강동구  1999-11-01
3  홍길북   22   buk@hong.com  서울시 관악구  1999-05-01
4  홍길중   23   mid@hong.com   부산시 중구  1999-01-30

## 2.4 패키지에서 가져오기 : iris 데이터

- 방법 1 : sklearn (머신러닝 패키지)
- 방법 2 : statsmodels (R 데이터)
- 방법 3 : seaborn (시각화 패키지)

### iris 데이터 가져오기 방법 1 : sklearn (머신러닝 패키지)

In [78]:
# sklearn : 머신러닝 패키지 (전처리 함수, 머신러닝 함수, 성능평가를 위한 함수, 학습데이터 셋)
from sklearn import datasets

iris = datasets.load_iris()  # 딕셔너리 형태
iris.keys()

dict_keys(['data', 'target', 'frame', 'target_names', 'DESCR', 'feature_names', 'filename', 'data_module'])

In [79]:
print(iris.DESCR)  # iris 데이터 셋에 대한 설명

.. _iris_dataset:

Iris plants dataset
--------------------

**Data Set Characteristics:**

    :Number of Instances: 150 (50 in each of three classes)
    :Number of Attributes: 4 numeric, predictive attributes and the class
    :Attribute Information:
        - sepal length in cm
        - sepal width in cm
        - petal length in cm
        - petal width in cm
        - class:
                - Iris-Setosa
                - Iris-Versicolour
                - Iris-Virginica

    :Summary Statistics:

    ============== ==== ==== ======= ===== ====================
                    Min  Max   Mean    SD   Class Correlation
    ============== ==== ==== ======= ===== ====================
    sepal length:   4.3  7.9   5.84   0.83    0.7826
    sepal width:    2.0  4.4   3.05   0.43   -0.4194
    petal length:   1.0  6.9   3.76   1.76    0.9490  (high!)
    petal width:    0.1  2.5   1.20   0.76    0.9565  (high!)
    ============== ==== ==== ======= ===== ====================

    :Missing Attribute Values: None
    :Class Distribution: 33.3% for each of 3 classes.
    :Creator: R.A. Fisher
    :Donor: Michael Marshall (MARSHALL%PLU@io.arc.nasa.gov)
    :Date: July, 1988

The famous Iris database, first used by Sir R.A. Fisher. The dataset is taken
from Fisher's paper. Note that it's the same as in R, but not as in the UCI
Machine Learning Repository, which has two wrong data points.

This is perhaps the best known database to be found in the
pattern recognition literature.  Fisher's paper is a classic in the field and
is referenced frequently to this day.  (See Duda & Hart, for example.)  The
data set contains 3 classes of 50 instances each, where each class refers to a
type of iris plant.  One class is linearly separable from the other 2; the
latter are NOT linearly separable from each other.

.. topic:: References

   - Fisher, R.A. "The use of multiple measurements in taxonomic problems"
     Annual Eugenics, 7, Part II, 179-188 (1936); also in "Contributions to
     Mathematical Statistics" (John Wiley, NY, 1950).
   - Duda, R.O., & Hart, P.E. (1973) Pattern Classification and Scene Analysis.
     (Q327.D83) John Wiley & Sons.  ISBN 0-471-22361-1.  See page 218.
   - Dasarathy, B.V. (1980) "Nosing Around the Neighborhood: A New System
     Structure and Classification Rule for Recognition in Partially Exposed
     Environments".  IEEE Transactions on Pattern Analysis and Machine
     Intelligence, Vol. PAMI-2, No. 1, 67-71.
   - Gates, G.W. (1972) "The Reduced Nearest Neighbor Rule".  IEEE Transactions
     on Information Theory, May 1972, 431-433.
   - See also: 1988 MLC Proceedings, 54-64.  Cheeseman et al"s AUTOCLASS II
     conceptual clustering system finds 3 classes in the data.
   - Many, many more ...

In [80]:
iris.data  # 독립변수
iris['data'][:3]

array([[5.1, 3.5, 1.4, 0.2],
       [4.9, 3. , 1.4, 0.2],
       [4.7, 3.2, 1.3, 0.2]])

In [81]:
iris.feature_names  # 독립변수의 열이름
iris['feature_names']

['sepal length (cm)',
 'sepal width (cm)',
 'petal length (cm)',
 'petal width (cm)']

In [84]:
# 데이터프레임에서 열이름

columns = [col[:-5].replace(' ', '_') for col in iris.feature_names] + ['species']
columns

['sepal_length', 'sepal_width', 'petal_length', 'petal_width', 'species']

In [86]:
iris.target
iris['target']  # 머신러닝 시 종속변수

array([0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
       0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
       0, 0, 0, 0, 0, 0, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1,
       1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1,
       1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2,
       2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2,
       2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2])

In [87]:
iris.target_names

array(['setosa', 'versicolor', 'virginica'], dtype='<U10')

In [88]:
iris.target_names[[iris.target]]

array([['setosa', 'setosa', 'setosa', 'setosa', 'setosa', 'setosa',
        'setosa', 'setosa', 'setosa', 'setosa', 'setosa', 'setosa',
        'setosa', 'setosa', 'setosa', 'setosa', 'setosa', 'setosa',
        'setosa', 'setosa', 'setosa', 'setosa', 'setosa', 'setosa',
        'setosa', 'setosa', 'setosa', 'setosa', 'setosa', 'setosa',
        'setosa', 'setosa', 'setosa', 'setosa', 'setosa', 'setosa',
        'setosa', 'setosa', 'setosa', 'setosa', 'setosa', 'setosa',
        'setosa', 'setosa', 'setosa', 'setosa', 'setosa', 'setosa',
        'setosa', 'setosa', 'versicolor', 'versicolor', 'versicolor',
        'versicolor', 'versicolor', 'versicolor', 'versicolor',
        'versicolor', 'versicolor', 'versicolor', 'versicolor',
        'versicolor', 'versicolor', 'versicolor', 'versicolor',
        'versicolor', 'versicolor', 'versicolor', 'versicolor',
        'versicolor', 'versicolor', 'versicolor', 'versicolor',
        'versicolor', 'versicolor', 'versicolor', 'versicolor',
        'versicolor', 'versicolor', 'versicolor', 'versicolor',
        'versicolor', 'versicolor', 'versicolor', 'versicolor',
        'versicolor', 'versicolor', 'versicolor', 'versicolor',
        'versicolor', 'versicolor', 'versicolor', 'versicolor',
        'versicolor', 'versicolor', 'versicolor', 'versicolor',
        'versicolor', 'versicolor', 'versicolor', 'virginica',
        'virginica', 'virginica', 'virginica', 'virginica', 'virginica',
        'virginica', 'virginica', 'virginica', 'virginica', 'virginica',
        'virginica', 'virginica', 'virginica', 'virginica', 'virginica',
        'virginica', 'virginica', 'virginica', 'virginica', 'virginica',
        'virginica', 'virginica', 'virginica', 'virginica', 'virginica',
        'virginica', 'virginica', 'virginica', 'virginica', 'virginica',
        'virginica', 'virginica', 'virginica', 'virginica', 'virginica',
        'virginica', 'virginica', 'virginica', 'virginica', 'virginica',
        'virginica', 'virginica', 'virginica', 'virginica', 'virginica',
        'virginica', 'virginica', 'virginica', 'virginica']], dtype='<U10')

In [89]:
# 독립변수

data = iris.data
target = iris.target_names[iris.target]
data.shape, target.shape  # 독립변수와 종속변수의 차원

((150, 4), (150,))

In [91]:
# 독립변수와 종속변수를 stack한 후 데이터프레임으로

pd.DataFrame(data = np.hstack((data, target.reshape(-1, 1))),
             columns = columns)

    sepal_length sepal_width petal_length petal_width    species
0            5.1         3.5          1.4         0.2     setosa
1            4.9         3.0          1.4         0.2     setosa
2            4.7         3.2          1.3         0.2     setosa
3            4.6         3.1          1.5         0.2     setosa
4            5.0         3.6          1.4         0.2     setosa
..           ...         ...          ...         ...        ...
145          6.7         3.0          5.2         2.3  virginica
146          6.3         2.5          5.0         1.9  virginica
147          6.5         3.0          5.2         2.0  virginica
148          6.2         3.4          5.4         2.3  virginica
149          5.9         3.0          5.1         1.8  virginica

[150 rows x 5 columns]

### iris 데이터 가져오기 방법 2 : statsmodels (R 데이터)

In [3]:
# R언어에 있는 유명한 데이터셋을 가져오는 함수

from statsmodels.datasets import get_rdataset

iris_dataset = get_rdataset('iris',
                            package = 'datasets',  # R의 datasets 패키지에서 가져오기
                            cache = True)  # 한번 다운로드한 데이터셋을 PC에 저장
iris_dataset

In [4]:
iris = iris_dataset.data
iris.head(1)

   Sepal.Length  Sepal.Width  Petal.Length  Petal.Width Species
0           5.1          3.5           1.4          0.2  setosa

In [7]:
iris['Sepal.Length']
# iris.Sepla.Length  열이름에 '.', ' '이 있으면 iris.Sepa.Length 같이 접근불가

0      5.1
1      4.9
2      4.7
3      4.6
4      5.0
      ...
145    6.7
146    6.3
147    6.5
148    6.2
149    5.9
Name: Sepal.Length, Length: 150, dtype: float64

In [12]:
iris.columns = [col.lower().replace('.', '_') for col in iris.columns]
iris.head(1)

   sepal_length  sepal_width  petal_length  petal_width species
0           5.1          3.5           1.4          0.2  setosa

### iris 데이터 가져오기 방법 3 : seaborn (시각화 패키지)

In [13]:
import seaborn as sns

iris = sns.load_dataset('iris')
iris.head(1)

   sepal_length  sepal_width  petal_length  petal_width species
0           5.1          3.5           1.4          0.2  setosa

In [14]:
# 데이터프레임을 csv파일로

iris.to_csv('data/ch11_iris.csv',
           # sep = ',', encoding = 'utf-8',  # 기본값
           index = False)  # 행이름을 제외하고 파일 출력

In [15]:
import pandas as pd

load_iris = pd.read_csv('data/ch11_iris.csv')
load_iris.head(1)

   sepal_length  sepal_width  petal_length  petal_width species
0           5.1          3.5           1.4          0.2  setosa

In [17]:
# 데이터프레임을 압축파일(.zip, .gz, .bz2)로 

iris.to_csv('data/ch11_iris.gz',
            index = False,
            compression = 'infer')

In [18]:
load_iris = pd.read_csv('data/ch11_iris.gz',
                        compression = 'infer')
load_iris

     sepal_length  sepal_width  petal_length  petal_width    species
0             5.1          3.5           1.4          0.2     setosa
1             4.9          3.0           1.4          0.2     setosa
2             4.7          3.2           1.3          0.2     setosa
3             4.6          3.1           1.5          0.2     setosa
4             5.0          3.6           1.4          0.2     setosa
..            ...          ...           ...          ...        ...
145           6.7          3.0           5.2          2.3  virginica
146           6.3          2.5           5.0          1.9  virginica
147           6.5          3.0           5.2          2.0  virginica
148           6.2          3.4           5.4          2.3  virginica
149           5.9          3.0           5.1          1.8  virginica

[150 rows x 5 columns]

# 3절. 이름(열, 행) 지정하기

## 3.1 열이름 지정하기

In [20]:
member = pd.read_csv('data/ch11_member.csv',
                     comment = '#',
                     parse_dates = ['Birth'])
member

  Name  Age          Email  Address      Birth
0  홍길동   20  hong@hong.com  서울시 강동구 1999-01-01
1  홍길서   30   seo@hong.com   서울시 중구 1999-12-01
2  홍길남   21   nam@hong.com  서울시 강동구 1999-11-01
3  홍길북   22   buk@hong.com  서울시 관악구 1999-05-01
4  홍길중   23   mid@hong.com   부산시 중구 1999-01-30

In [26]:
member.columns = ['이름', '나이', '메일', '주소', '생년월일']
member.columns.name = None
member

    이름  나이             메일       주소       생년월일
0  홍길동  20  hong@hong.com  서울시 강동구 1999-01-01
1  홍길서  30   seo@hong.com   서울시 중구 1999-12-01
2  홍길남  21   nam@hong.com  서울시 강동구 1999-11-01
3  홍길북  22   buk@hong.com  서울시 관악구 1999-05-01
4  홍길중  23   mid@hong.com   부산시 중구 1999-01-30

## 3.2 행이름 지정하기

In [51]:
member.index

MultiIndex([('좌우', '동'),
            ('좌우', '서'),
            ('상하', '남'),
            ('상하', '북'),
            ('상하', '중')],
           names=['레벨1', '레벨2'])

In [52]:
member.index = range(11, 16)
member

대분류 기본정보                        추가정보
소분류   이름  나이             메일       주소       생년월일
11   홍길동  20  hong@hong.com  서울시 강동구 1999-01-01
12   홍길서  30   seo@hong.com   서울시 중구 1999-12-01
13   홍길남  21   nam@hong.com  서울시 강동구 1999-11-01
14   홍길북  22   buk@hong.com  서울시 관악구 1999-05-01
15   홍길중  23   mid@hong.com   부산시 중구 1999-01-30

In [53]:
member.index = ['동', '서', '남', '북', '중']
member

대분류 기본정보                        추가정보
소분류   이름  나이             메일       주소       생년월일
동    홍길동  20  hong@hong.com  서울시 강동구 1999-01-01
서    홍길서  30   seo@hong.com   서울시 중구 1999-12-01
남    홍길남  21   nam@hong.com  서울시 강동구 1999-11-01
북    홍길북  22   buk@hong.com  서울시 관악구 1999-05-01
중    홍길중  23   mid@hong.com   부산시 중구 1999-01-30

In [161]:
member.index.name = None
print(member.index.name)

None

In [55]:
member

대분류 기본정보                        추가정보
소분류   이름  나이             메일       주소       생년월일
동    홍길동  20  hong@hong.com  서울시 강동구 1999-01-01
서    홍길서  30   seo@hong.com   서울시 중구 1999-12-01
남    홍길남  21   nam@hong.com  서울시 강동구 1999-11-01
북    홍길북  22   buk@hong.com  서울시 관악구 1999-05-01
중    홍길중  23   mid@hong.com   부산시 중구 1999-01-30

In [31]:
member.loc['남', '이름']  # loc를 이용하여 행이름과 열이름으로 데이터 부분 조회

'홍길남'

In [33]:
# 특징을 index로 setting
# member를 수정하려면 (1)할당 (2)inplace 매개변수에 True (기본값은 False)

member1 = member.set_index('이름')  # 이름열이 index로 setting
member1

     나이             메일       주소       생년월일
이름
홍길동  20  hong@hong.com  서울시 강동구 1999-01-01
홍길서  30   seo@hong.com   서울시 중구 1999-12-01
홍길남  21   nam@hong.com  서울시 강동구 1999-11-01
홍길북  22   buk@hong.com  서울시 관악구 1999-05-01
홍길중  23   mid@hong.com   부산시 중구 1999-01-30

In [34]:
member.set_index('이름', inplace = True)  # 이름열을 index로

In [36]:
member.head(1)

     나이             메일       주소       생년월일
이름
홍길동  20  hong@hong.com  서울시 강동구 1999-01-01

In [38]:
member.reset_index(inplace = True)  # index를 컬럼(열)로

In [39]:
member

    이름  나이             메일       주소       생년월일
0  홍길동  20  hong@hong.com  서울시 강동구 1999-01-01
1  홍길서  30   seo@hong.com   서울시 중구 1999-12-01
2  홍길남  21   nam@hong.com  서울시 강동구 1999-11-01
3  홍길북  22   buk@hong.com  서울시 관악구 1999-05-01
4  홍길중  23   mid@hong.com   부산시 중구 1999-01-30

In [40]:
member.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5 entries, 0 to 4
Data columns (total 5 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   이름      5 non-null      object
 1   나이      5 non-null      int64
 2   메일      5 non-null      object
 3   주소      5 non-null      object
 4   생년월일    5 non-null      datetime64[ns]
dtypes: datetime64[ns](1), int64(1), object(3)
memory usage: 328.0+ bytes

In [41]:
member.loc[1, '생년월일']

Timestamp('1999-12-01 00:00:00')

In [42]:
# 시리즈(날짜형).dt : datetime열의 날짜 및 시간에 관련된 정보만 추출

member['생년월일'].dt.year

0    1999
1    1999
2    1999
3    1999
4    1999
Name: 생년월일, dtype: int64

In [43]:
member['생년월일'].dt.weekday  # 0:월, 1:화, 2:수, 3:목, 4:금, 5:토, 6:일

0    4
1    2
2    0
3    5
4    5
Name: 생년월일, dtype: int64

## 3.3 레벨 이름 지정하기

In [44]:
member

    이름  나이             메일       주소       생년월일
0  홍길동  20  hong@hong.com  서울시 강동구 1999-01-01
1  홍길서  30   seo@hong.com   서울시 중구 1999-12-01
2  홍길남  21   nam@hong.com  서울시 강동구 1999-11-01
3  홍길북  22   buk@hong.com  서울시 관악구 1999-05-01
4  홍길중  23   mid@hong.com   부산시 중구 1999-01-30

In [45]:
member.columns = [['기본정보', '기본정보', '기본정보', '추가정보', '추가정보'],
                  ['이름', '나이', '메일', '주소', '생년월일']]
member.columns.names = ['대분류', '소분류']
member

대분류 기본정보                        추가정보
소분류   이름  나이             메일       주소       생년월일
0    홍길동  20  hong@hong.com  서울시 강동구 1999-01-01
1    홍길서  30   seo@hong.com   서울시 중구 1999-12-01
2    홍길남  21   nam@hong.com  서울시 강동구 1999-11-01
3    홍길북  22   buk@hong.com  서울시 관악구 1999-05-01
4    홍길중  23   mid@hong.com   부산시 중구 1999-01-30

In [46]:
member.index = [['좌우', '좌우', '상하', '상하', '상하'],
                ['동', '서', '남', '북', '중']]
member.index.names = ['레벨1','레벨2']
member

대분류     기본정보                        추가정보
소분류       이름  나이             메일       주소       생년월일
레벨1 레벨2
좌우  동    홍길동  20  hong@hong.com  서울시 강동구 1999-01-01
    서    홍길서  30   seo@hong.com   서울시 중구 1999-12-01
상하  남    홍길남  21   nam@hong.com  서울시 강동구 1999-11-01
    북    홍길북  22   buk@hong.com  서울시 관악구 1999-05-01
    중    홍길중  23   mid@hong.com   부산시 중구 1999-01-30

In [48]:
member.loc[('좌우', '동'), '기본정보']

소분류
이름              홍길동
나이               20
메일    hong@hong.com
Name: (좌우, 동), dtype: object

# 4절. 부분 데이터 조회

In [56]:
member = pd.read_csv('data/ch11_member.csv',
                     comment = '#',
                     parse_dates = ['Birth'])
member

  Name  Age          Email  Address      Birth
0  홍길동   20  hong@hong.com  서울시 강동구 1999-01-01
1  홍길서   30   seo@hong.com   서울시 중구 1999-12-01
2  홍길남   21   nam@hong.com  서울시 강동구 1999-11-01
3  홍길북   22   buk@hong.com  서울시 관악구 1999-05-01
4  홍길중   23   mid@hong.com   부산시 중구 1999-01-30

## 4.1 열 조회

In [163]:
member['Name']
member.Name

동    홍길동
서    홍길서
남    홍길남
북    홍길북
중    홍길중
Name: Name, dtype: object

In [58]:
member[['Name', 'Email']]

  Name          Email
0  홍길동  hong@hong.com
1  홍길서   seo@hong.com
2  홍길남   nam@hong.com
3  홍길북   buk@hong.com
4  홍길중   mid@hong.com

In [59]:
# member[0]  행을 조회할 경우 loc, iloc.  []안에는 열이름이나 조건만 사용 가능

## 4.2 loc을 이용한 조회

- df.loc[행이름, 열이름] : 행이름과 열이름으로 조회
    * 행이름과 열이름 자리에 list ex.['Name', 'Email']
    * 행이름과 열이름 자리에 슬라이싱 from:to : from부터 to까지 (from, to 포함)
    * , 열이름 생략시 모든 열

In [60]:
# member 0행부터 2행

member.loc[0:2]

  Name  Age          Email  Address      Birth
0  홍길동   20  hong@hong.com  서울시 강동구 1999-01-01
1  홍길서   30   seo@hong.com   서울시 중구 1999-12-01
2  홍길남   21   nam@hong.com  서울시 강동구 1999-11-01

In [61]:
member.index = ['동', '서', '남', '북', '중']
member

  Name  Age          Email  Address      Birth
동  홍길동   20  hong@hong.com  서울시 강동구 1999-01-01
서  홍길서   30   seo@hong.com   서울시 중구 1999-12-01
남  홍길남   21   nam@hong.com  서울시 강동구 1999-11-01
북  홍길북   22   buk@hong.com  서울시 관악구 1999-05-01
중  홍길중   23   mid@hong.com   부산시 중구 1999-01-30

In [62]:
# member 동행부터 남행까지

member.loc['동':'남']

  Name  Age          Email  Address      Birth
동  홍길동   20  hong@hong.com  서울시 강동구 1999-01-01
서  홍길서   30   seo@hong.com   서울시 중구 1999-12-01
남  홍길남   21   nam@hong.com  서울시 강동구 1999-11-01

In [63]:
# member 동행부터 남행, 'Name'부터 'Email'까지

member.loc['동':'남', 'Name':'Email']

  Name  Age          Email
동  홍길동   20  hong@hong.com
서  홍길서   30   seo@hong.com
남  홍길남   21   nam@hong.com

In [65]:
# member 동행과 남행, 'Name', 'Email', 'Address'

member.loc[['동','남'], ['Name', 'Email', 'Address']]

  Name          Email  Address
동  홍길동  hong@hong.com  서울시 강동구
남  홍길남   nam@hong.com  서울시 강동구

In [64]:
# loc을 이용한 특정 열 조회

member.loc[:, ['Name', 'Address']]  # member['Name', 'Address']와 동일

  Name  Address
동  홍길동  서울시 강동구
서  홍길서   서울시 중구
남  홍길남  서울시 강동구
북  홍길북  서울시 관악구
중  홍길중   부산시 중구

In [66]:
member.loc['동']  # 결과가 1차원 : 시리즈

Name                       홍길동
Age                         20
Email            hong@hong.com
Address                서울시 강동구
Birth      1999-01-01 00:00:00
Name: 동, dtype: object

In [67]:
member.loc['동':'동']  # 슬라이싱의 경우 결과가 2차원 → 데이터프레임

  Name  Age          Email  Address      Birth
동  홍길동   20  hong@hong.com  서울시 강동구 1999-01-01

## 4.3 iloc을 이용한 조회
- df.iloc[행번호, 열번호] : 행번호와 열번호로 조회
    * 행번호와 열번호 자리에 list ex.[0, 2]
    * 행번화와 열번호 자리에 슬라이싱 from:to:by : from부터 by씩 증감하면서 to앞까지 (to는 미포함)
    * , 열번호 생략시 모든 열

In [68]:
# 0번째~2번째 행 모든 열
# member.loc['동':'남']

member.iloc[0:3]  # 열번호 생략시 모든 열

  Name  Age          Email  Address      Birth
동  홍길동   20  hong@hong.com  서울시 강동구 1999-01-01
서  홍길서   30   seo@hong.com   서울시 중구 1999-12-01
남  홍길남   21   nam@hong.com  서울시 강동구 1999-11-01

In [69]:
member.iloc[0]  # 결과가 1차원이면 시리즈.  데이터프레임으로 하고자 하면 슬라이싱을 이용하거나 pd.DataFrame()함수 이용

Name                       홍길동
Age                         20
Email            hong@hong.com
Address                서울시 강동구
Birth      1999-01-01 00:00:00
Name: 동, dtype: object

In [70]:
# 짝수번째 행의 맨 마지막 열을 제외한 데이터 추출

member.iloc[::2, :-1]

  Name  Age          Email  Address
동  홍길동   20  hong@hong.com  서울시 강동구
남  홍길남   21   nam@hong.com  서울시 강동구
중  홍길중   23   mid@hong.com   부산시 중구

In [71]:
# 모든 행의 마지막 열만 데이터프레임으로 추출

member.iloc[:, -1:]  # member.iloc[:, -1] 1차원

       Birth
동 1999-01-01
서 1999-12-01
남 1999-11-01
북 1999-05-01
중 1999-01-30

In [72]:
member.iloc[:, -1]

동   1999-01-01
서   1999-12-01
남   1999-11-01
북   1999-05-01
중   1999-01-30
Name: Birth, dtype: datetime64[ns]

In [74]:
# 0번째, 3번째 행, 0번째, 3번째, 4번째 열

member.iloc[0:4:3, [0, 3, 4]]

  Name  Address      Birth
동  홍길동  서울시 강동구 1999-01-01
북  홍길북  서울시 관악구 1999-05-01

## 4.4 조건으로 조회

- df[조건] : 조건에 맞는 행 (모든 열)
- df.loc[조건, 열이름] 또는 df[조건][열이름] : 조건에 맞는 행의 특정 열

In [75]:
member

  Name  Age          Email  Address      Birth
동  홍길동   20  hong@hong.com  서울시 강동구 1999-01-01
서  홍길서   30   seo@hong.com   서울시 중구 1999-12-01
남  홍길남   21   nam@hong.com  서울시 강동구 1999-11-01
북  홍길북   22   buk@hong.com  서울시 관악구 1999-05-01
중  홍길중   23   mid@hong.com   부산시 중구 1999-01-30

In [78]:
member.Age > 22

동    False
서     True
남    False
북    False
중     True
Name: Age, dtype: bool

In [77]:
# Age가 22보다 큰 데이터셋

member[member.Age > 22]

  Name  Age         Email Address      Birth
서  홍길서   30  seo@hong.com  서울시 중구 1999-12-01
중  홍길중   23  mid@hong.com  부산시 중구 1999-01-30

In [79]:
# Age가 22보다 큰 데이터의 Name과 Age

member[member.Age > 22][['Name','Age']]  # 슬라이싱 불가능

  Name  Age
서  홍길서   30
중  홍길중   23

In [83]:
# Age가 22보다 큰 데이터의 Name부터 Email까지

member.loc[member.Age > 22, 'Name':'Email']

  Name  Age         Email
서  홍길서   30  seo@hong.com
중  홍길중   23  mid@hong.com

In [85]:
address1 = '서울시 강동구'
address2 = '부산시 중구'

print(address1.startswith('서울시'))
print(address2.startswith('서울시'))
print(address1.find('강동구') != -1)
print(address2.count('강동구') > 0)

True
False
True
False

※ 교안 pdf p.29 시리즈에 문자함수를 쓰기 위해 참조 :
https://pandas.pydata.org/pandas-docs/stable/reference/series.html#string-handling

In [87]:
member.Address.str.startswith('서울시')

동     True
서     True
남     True
북     True
중    False
Name: Address, dtype: bool

In [88]:
# Address가 '서울시'로 시작하는 행

member[member.Address.str.startswith('서울시')]

  Name  Age          Email  Address      Birth
동  홍길동   20  hong@hong.com  서울시 강동구 1999-01-01
서  홍길서   30   seo@hong.com   서울시 중구 1999-12-01
남  홍길남   21   nam@hong.com  서울시 강동구 1999-11-01
북  홍길북   22   buk@hong.com  서울시 관악구 1999-05-01

In [92]:
# Address에 '강동구'가 포함된 행

member[member.Address.str.count('강동구') > 0]
member[member.Address.str.find('강동구') > 0]
member[member.Address.str.contains('강동구') > 0]

  Name  Age          Email  Address      Birth
동  홍길동   20  hong@hong.com  서울시 강동구 1999-01-01
남  홍길남   21   nam@hong.com  서울시 강동구 1999-11-01

In [95]:
# Address에 '강동구'가 포함된 'Name', 'Age' 열 조회

member[member.Address.str.contains('강동구')][['Name', 'Age']]
member.loc[member.Address.str.contains('강동구'), 'Name':'Age']

  Name  Age
동  홍길동   20
남  홍길남   21

In [96]:
# 1999년도 태어난 데이터

member[member.Birth.dt.year < 2000]

  Name  Age          Email  Address      Birth
동  홍길동   20  hong@hong.com  서울시 강동구 1999-01-01
서  홍길서   30   seo@hong.com   서울시 중구 1999-12-01
남  홍길남   21   nam@hong.com  서울시 강동구 1999-11-01
북  홍길북   22   buk@hong.com  서울시 관악구 1999-05-01
중  홍길중   23   mid@hong.com   부산시 중구 1999-01-30

※ 데이터프레임의 부분 데이터 조회 방법
- df[열이름] - 특정 열 모든 행조회
- df[조건] - 조건에 맞는 모든 행 조회
- df.loc[행이름, 열이름] : 이름조회, 조건(행이름 자리)으로 조회 가능
    * 열이름을 생략하면 모든 열
    * 행이름, 열이름 자리에 list, 슬라이싱
- df.iloc[행번호, 열번호] : 번호 조회
    * 열번호를 생략하면 모든 열
    * 행번호, 열번호 자리에 list, 슬라이싱

In [98]:
import seaborn as sns

iris = sns.load_dataset('iris')
iris.head(1)

   sepal_length  sepal_width  petal_length  petal_width species
0           5.1          3.5           1.4          0.2  setosa

In [106]:
# 1. sepal_length 열만 출력

iris.loc[:,['sepal_length']]

     sepal_length
0             5.1
1             4.9
2             4.7
3             4.6
4             5.0
..            ...
145           6.7
146           6.3
147           6.5
148           6.2
149           5.9

[150 rows x 1 columns]

In [122]:
# 2. 0~10행까지 마지막 열을 제외한 데이터 (loc, iloc)

iris.loc[:10, 'sepal_length':'petal_width']

    sepal_length  sepal_width  petal_length  petal_width
0            5.1          3.5           1.4          0.2
1            4.9          3.0           1.4          0.2
2            4.7          3.2           1.3          0.2
3            4.6          3.1           1.5          0.2
4            5.0          3.6           1.4          0.2
5            5.4          3.9           1.7          0.4
6            4.6          3.4           1.4          0.3
7            5.0          3.4           1.5          0.2
8            4.4          2.9           1.4          0.2
9            4.9          3.1           1.5          0.1
10           5.4          3.7           1.5          0.2

In [124]:
iris.iloc[:11, :-1]

    sepal_length  sepal_width  petal_length  petal_width
0            5.1          3.5           1.4          0.2
1            4.9          3.0           1.4          0.2
2            4.7          3.2           1.3          0.2
3            4.6          3.1           1.5          0.2
4            5.0          3.6           1.4          0.2
5            5.4          3.9           1.7          0.4
6            4.6          3.4           1.4          0.3
7            5.0          3.4           1.5          0.2
8            4.4          2.9           1.4          0.2
9            4.9          3.1           1.5          0.1
10           5.4          3.7           1.5          0.2

In [126]:
# 3. 3~10 행중에 'sepal_length'와 'petal_length' 열만 (loc, iloc)

iris.loc[3:10, ['sepal_length', 'petal_length']]

    sepal_length  petal_length
3            4.6           1.5
4            5.0           1.4
5            5.4           1.7
6            4.6           1.4
7            5.0           1.5
8            4.4           1.4
9            4.9           1.5
10           5.4           1.5

In [129]:
iris.iloc[3:11, [0, 2]]

    sepal_length  petal_length
3            4.6           1.5
4            5.0           1.4
5            5.4           1.7
6            4.6           1.4
7            5.0           1.5
8            4.4           1.4
9            4.9           1.5
10           5.4           1.5

In [138]:
# 4. 0번째, 50번째, 100번째 행의 모든 열 (loc, iloc)

iris.loc[[0, 50, 100]]

     sepal_length  sepal_width  petal_length  petal_width     species
0             5.1          3.5           1.4          0.2      setosa
50            7.0          3.2           4.7          1.4  versicolor
100           6.3          3.3           6.0          2.5   virginica

In [165]:
iris.loc[0:100:50]  # 비추

     sepal_length  sepal_width  petal_length  petal_width     species
0             5.1          3.5           1.4          0.2      setosa
50            7.0          3.2           4.7          1.4  versicolor
100           6.3          3.3           6.0          2.5   virginica

In [134]:
iris.iloc[0:101:50]

     sepal_length  sepal_width  petal_length  petal_width     species
0             5.1          3.5           1.4          0.2      setosa
50            7.0          3.2           4.7          1.4  versicolor
100           6.3          3.3           6.0          2.5   virginica

In [167]:
# 5. 0번째, 25번쨰, 50번째, 75번째, 100번째, 125번째 행의 petal_length와 petal_width (loc, iloc)

iris.loc[[0, 25, 50, 75, 100, 125], 'petal_length':'petal_width']

     petal_length  petal_width
0             1.4          0.2
25            1.6          0.2
50            4.7          1.4
75            4.4          1.4
100           6.0          2.5
125           6.0          1.8

In [168]:
iris.loc[:125:25, 'petal_length':'petal_width']  # 비추

     petal_length  petal_width
0             1.4          0.2
25            1.6          0.2
50            4.7          1.4
75            4.4          1.4
100           6.0          2.5
125           6.0          1.8

In [173]:
iris.iloc[0:126:25, 2:4]

     petal_length  petal_width
0             1.4          0.2
25            1.6          0.2
50            4.7          1.4
75            4.4          1.4
100           6.0          2.5
125           6.0          1.8

In [148]:
# 6. species가 versicolor인 데이터의 모든 열

iris[iris.species.str.startswith('versicolor')]

    sepal_length  sepal_width  petal_length  petal_width     species
50           7.0          3.2           4.7          1.4  versicolor
51           6.4          3.2           4.5          1.5  versicolor
52           6.9          3.1           4.9          1.5  versicolor
53           5.5          2.3           4.0          1.3  versicolor
54           6.5          2.8           4.6          1.5  versicolor
55           5.7          2.8           4.5          1.3  versicolor
56           6.3          3.3           4.7          1.6  versicolor
57           4.9          2.4           3.3          1.0  versicolor
58           6.6          2.9           4.6          1.3  versicolor
59           5.2          2.7           3.9          1.4  versicolor
60           5.0          2.0           3.5          1.0  versicolor
61           5.9          3.0           4.2          1.5  versicolor
62           6.0          2.2           4.0          1.0  versicolor
63           6.1          2.9           4.7          1.4  versicolor
64           5.6          2.9           3.6          1.3  versicolor
65           6.7          3.1           4.4          1.4  versicolor
66           5.6          3.0           4.5          1.5  versicolor
67           5.8          2.7           4.1          1.0  versicolor
68           6.2          2.2           4.5          1.5  versicolor
69           5.6          2.5           3.9          1.1  versicolor
70           5.9          3.2           4.8          1.8  versicolor
71           6.1          2.8           4.0          1.3  versicolor
72           6.3          2.5           4.9          1.5  versicolor
73           6.1          2.8           4.7          1.2  versicolor
74           6.4          2.9           4.3          1.3  versicolor
75           6.6          3.0           4.4          1.4  versicolor
76           6.8          2.8           4.8          1.4  versicolor
77           6.7          3.0           5.0          1.7  versicolor
78           6.0          2.9           4.5          1.5  versicolor
79           5.7          2.6           3.5          1.0  versicolor
80           5.5          2.4           3.8          1.1  versicolor
81           5.5          2.4           3.7          1.0  versicolor
82           5.8          2.7           3.9          1.2  versicolor
83           6.0          2.7           5.1          1.6  versicolor
84           5.4          3.0           4.5          1.5  versicolor
85           6.0          3.4           4.5          1.6  versicolor
86           6.7          3.1           4.7          1.5  versicolor
87           6.3          2.3           4.4          1.3  versicolor
88           5.6          3.0           4.1          1.3  versicolor
89           5.5          2.5           4.0          1.3  versicolor
90           5.5          2.6           4.4          1.2  versicolor
91           6.1          3.0           4.6          1.4  versicolor
92           5.8          2.6           4.0          1.2  versicolor
93           5.0          2.3           3.3          1.0  versicolor
94           5.6          2.7           4.2          1.3  versicolor
95           5.7          3.0           4.2          1.2  versicolor
96           5.7          2.9           4.2          1.3  versicolor
97           6.2          2.9           4.3          1.3  versicolor
98           5.1          2.5           3.0          1.1  versicolor
99           5.7          2.8           4.1          1.3  versicolor

In [174]:
iris[iris.species == 'versicolor']

    sepal_length  sepal_width  petal_length  petal_width     species
50           7.0          3.2           4.7          1.4  versicolor
51           6.4          3.2           4.5          1.5  versicolor
52           6.9          3.1           4.9          1.5  versicolor
53           5.5          2.3           4.0          1.3  versicolor
54           6.5          2.8           4.6          1.5  versicolor
55           5.7          2.8           4.5          1.3  versicolor
56           6.3          3.3           4.7          1.6  versicolor
57           4.9          2.4           3.3          1.0  versicolor
58           6.6          2.9           4.6          1.3  versicolor
59           5.2          2.7           3.9          1.4  versicolor
60           5.0          2.0           3.5          1.0  versicolor
61           5.9          3.0           4.2          1.5  versicolor
62           6.0          2.2           4.0          1.0  versicolor
63           6.1          2.9           4.7          1.4  versicolor
64           5.6          2.9           3.6          1.3  versicolor
65           6.7          3.1           4.4          1.4  versicolor
66           5.6          3.0           4.5          1.5  versicolor
67           5.8          2.7           4.1          1.0  versicolor
68           6.2          2.2           4.5          1.5  versicolor
69           5.6          2.5           3.9          1.1  versicolor
70           5.9          3.2           4.8          1.8  versicolor
71           6.1          2.8           4.0          1.3  versicolor
72           6.3          2.5           4.9          1.5  versicolor
73           6.1          2.8           4.7          1.2  versicolor
74           6.4          2.9           4.3          1.3  versicolor
75           6.6          3.0           4.4          1.4  versicolor
76           6.8          2.8           4.8          1.4  versicolor
77           6.7          3.0           5.0          1.7  versicolor
78           6.0          2.9           4.5          1.5  versicolor
79           5.7          2.6           3.5          1.0  versicolor
80           5.5          2.4           3.8          1.1  versicolor
81           5.5          2.4           3.7          1.0  versicolor
82           5.8          2.7           3.9          1.2  versicolor
83           6.0          2.7           5.1          1.6  versicolor
84           5.4          3.0           4.5          1.5  versicolor
85           6.0          3.4           4.5          1.6  versicolor
86           6.7          3.1           4.7          1.5  versicolor
87           6.3          2.3           4.4          1.3  versicolor
88           5.6          3.0           4.1          1.3  versicolor
89           5.5          2.5           4.0          1.3  versicolor
90           5.5          2.6           4.4          1.2  versicolor
91           6.1          3.0           4.6          1.4  versicolor
92           5.8          2.6           4.0          1.2  versicolor
93           5.0          2.3           3.3          1.0  versicolor
94           5.6          2.7           4.2          1.3  versicolor
95           5.7          3.0           4.2          1.2  versicolor
96           5.7          2.9           4.2          1.3  versicolor
97           6.2          2.9           4.3          1.3  versicolor
98           5.1          2.5           3.0          1.1  versicolor
99           5.7          2.8           4.1          1.3  versicolor

In [176]:
# 7. species가 setosa인 데이터 최초 5개 행만 출력

iris[iris.species.str.startswith('setosa')].head()

   sepal_length  sepal_width  petal_length  petal_width species
0           5.1          3.5           1.4          0.2  setosa
1           4.9          3.0           1.4          0.2  setosa
2           4.7          3.2           1.3          0.2  setosa
3           4.6          3.1           1.5          0.2  setosa
4           5.0          3.6           1.4          0.2  setosa

In [177]:
iris[iris.species == 'setosa'].iloc[:5]

   sepal_length  sepal_width  petal_length  petal_width species
0           5.1          3.5           1.4          0.2  setosa
1           4.9          3.0           1.4          0.2  setosa
2           4.7          3.2           1.3          0.2  setosa
3           4.6          3.1           1.5          0.2  setosa
4           5.0          3.6           1.4          0.2  setosa

In [179]:
# 8. sepal_length가 6.5이상인 데이터 최초 5개 행만 출력

iris[iris.sepal_length >= 6.5].head(5)

    sepal_length  sepal_width  petal_length  petal_width     species
50           7.0          3.2           4.7          1.4  versicolor
52           6.9          3.1           4.9          1.5  versicolor
54           6.5          2.8           4.6          1.5  versicolor
58           6.6          2.9           4.6          1.3  versicolor
65           6.7          3.1           4.4          1.4  versicolor

In [181]:
iris[iris.sepal_length >= 6.5].iloc[:5]

    sepal_length  sepal_width  petal_length  petal_width     species
50           7.0          3.2           4.7          1.4  versicolor
52           6.9          3.1           4.9          1.5  versicolor
54           6.5          2.8           4.6          1.5  versicolor
58           6.6          2.9           4.6          1.3  versicolor
65           6.7          3.1           4.4          1.4  versicolor

In [188]:
# 9. sepal_length가 7.2이상인 데이터의 'sepal_length'와 'sepal_width'와 'petal_length'

iris[iris.sepal_length >= 7.2][['sepal_length', 'sepal_width', 'petal_length']]

     sepal_length  sepal_width  petal_length
105           7.6          3.0           6.6
107           7.3          2.9           6.3
109           7.2          3.6           6.1
117           7.7          3.8           6.7
118           7.7          2.6           6.9
122           7.7          2.8           6.7
125           7.2          3.2           6.0
129           7.2          3.0           5.8
130           7.4          2.8           6.1
131           7.9          3.8           6.4
135           7.7          3.0           6.1

In [189]:
iris.loc[iris.sepal_length >= 7.2, 'sepal_length':'petal_length']

     sepal_length  sepal_width  petal_length
105           7.6          3.0           6.6
107           7.3          2.9           6.3
109           7.2          3.6           6.1
117           7.7          3.8           6.7
118           7.7          2.6           6.9
122           7.7          2.8           6.7
125           7.2          3.2           6.0
129           7.2          3.0           5.8
130           7.4          2.8           6.1
131           7.9          3.8           6.4
135           7.7          3.0           6.1

In [159]:
# 10. versicolor 중에서 sepal_length가 6.5보다 큰 데이터의 모든 열

iris_ = iris[iris.species.str.startswith('versicolor')]
iris_[iris_.sepal_length > 6.5]

    sepal_length  sepal_width  petal_length  petal_width     species
50           7.0          3.2           4.7          1.4  versicolor
52           6.9          3.1           4.9          1.5  versicolor
58           6.6          2.9           4.6          1.3  versicolor
65           6.7          3.1           4.4          1.4  versicolor
75           6.6          3.0           4.4          1.4  versicolor
76           6.8          2.8           4.8          1.4  versicolor
77           6.7          3.0           5.0          1.7  versicolor
86           6.7          3.1           4.7          1.5  versicolor

In [184]:
iris[(iris.species == 'versicolor') & (iris.sepal_length > 6.5)]

    sepal_length  sepal_width  petal_length  petal_width     species
50           7.0          3.2           4.7          1.4  versicolor
52           6.9          3.1           4.9          1.5  versicolor
58           6.6          2.9           4.6          1.3  versicolor
65           6.7          3.1           4.4          1.4  versicolor
75           6.6          3.0           4.4          1.4  versicolor
76           6.8          2.8           4.8          1.4  versicolor
77           6.7          3.0           5.0          1.7  versicolor
86           6.7          3.1           4.7          1.5  versicolor

In [183]:
import numpy as np
np.logical_and(True, True)

True

In [187]:
iris[(iris.species == 'versicolor') & (iris.sepal_length > 6.5)]
iris[np.logical_and(iris.species == 'versicolor', iris.sepal_length > 6.5)]

    sepal_length  sepal_width  petal_length  petal_width     species
50           7.0          3.2           4.7          1.4  versicolor
52           6.9          3.1           4.9          1.5  versicolor
58           6.6          2.9           4.6          1.3  versicolor
65           6.7          3.1           4.4          1.4  versicolor
75           6.6          3.0           4.4          1.4  versicolor
76           6.8          2.8           4.8          1.4  versicolor
77           6.7          3.0           5.0          1.7  versicolor
86           6.7          3.1           4.7          1.5  versicolor

# 5절. 데이터 추가 및 삭제

## 5.1 데이터프레임의 요소 삭제

- df.drop(행이름이나 열이름, axis) : axis = 0 : 행삭제 / axis = 1 : 열삭제

In [256]:
member = pd.read_csv('data/ch11_member.csv', comment = '#')
member.index = ['동', '서', '남', '북', '중']
member

  Name  Age          Email  Address       Birth
동  홍길동   20  hong@hong.com  서울시 강동구  1999-01-01
서  홍길서   30   seo@hong.com   서울시 중구  1999-12-01
남  홍길남   21   nam@hong.com  서울시 강동구  1999-11-01
북  홍길북   22   buk@hong.com  서울시 관악구  1999-05-01
중  홍길중   23   mid@hong.com   부산시 중구  1999-01-30

In [259]:
# (1) 단일행 삭제 : 문자

member.drop('중')  # axis = 0 이 기본값

  Name  Age          Email  Address       Birth
동  홍길동   20  hong@hong.com  서울시 강동구  1999-01-01
서  홍길서   30   seo@hong.com   서울시 중구  1999-12-01
남  홍길남   21   nam@hong.com  서울시 강동구  1999-11-01
북  홍길북   22   buk@hong.com  서울시 관악구  1999-05-01

In [260]:
member.drop('동', inplace = True)  # '동'행이 없으면 에러
member

  Name  Age         Email  Address       Birth
서  홍길서   30  seo@hong.com   서울시 중구  1999-12-01
남  홍길남   21  nam@hong.com  서울시 강동구  1999-11-01
북  홍길북   22  buk@hong.com  서울시 관악구  1999-05-01
중  홍길중   23  mid@hong.com   부산시 중구  1999-01-30

In [261]:
# (2) 복수행 삭제 : 리스트

member.drop(['서', '남'])

  Name  Age         Email  Address       Birth
북  홍길북   22  buk@hong.com  서울시 관악구  1999-05-01
중  홍길중   23  mid@hong.com   부산시 중구  1999-01-30

In [262]:
# (3) 열 삭제 : 단일 → 문자, 복수 → 리스트

member.drop(labels = ['Age', 'Birth'], axis = 1)  # labels는 안 써도 상관없음

  Name         Email  Address
서  홍길서  seo@hong.com   서울시 중구
남  홍길남  nam@hong.com  서울시 강동구
북  홍길북  buk@hong.com  서울시 관악구
중  홍길중  mid@hong.com   부산시 중구

## 5.2 데이터프레임의 요소 추가

In [264]:
member = pd.read_csv('data/ch11_member.csv', comment='#')
member

  Name  Age          Email  Address       Birth
0  홍길동   20  hong@hong.com  서울시 강동구  1999-01-01
1  홍길서   30   seo@hong.com   서울시 중구  1999-12-01
2  홍길남   21   nam@hong.com  서울시 강동구  1999-11-01
3  홍길북   22   buk@hong.com  서울시 관악구  1999-05-01
4  홍길중   23   mid@hong.com   부산시 중구  1999-01-30

In [265]:
# 데이터프레임에 열 추가 방법 1 : 공통된 값으로 추가

member['favarite_no'] = 7  # int64
member

  Name  Age          Email  Address       Birth  favarite_no
0  홍길동   20  hong@hong.com  서울시 강동구  1999-01-01            7
1  홍길서   30   seo@hong.com   서울시 중구  1999-12-01            7
2  홍길남   21   nam@hong.com  서울시 강동구  1999-11-01            7
3  홍길북   22   buk@hong.com  서울시 관악구  1999-05-01            7
4  홍길중   23   mid@hong.com   부산시 중구  1999-01-30            7

In [266]:
# 데이터프레임에 열 추가 방법 2 : 리스트로 추가

member['fn'] = [7, 7, 7, None, 7]  # 결측치 : None, np.nan, math.nan
member

  Name  Age          Email  Address       Birth  favarite_no   fn
0  홍길동   20  hong@hong.com  서울시 강동구  1999-01-01            7  7.0
1  홍길서   30   seo@hong.com   서울시 중구  1999-12-01            7  7.0
2  홍길남   21   nam@hong.com  서울시 강동구  1999-11-01            7  7.0
3  홍길북   22   buk@hong.com  서울시 관악구  1999-05-01            7  NaN
4  홍길중   23   mid@hong.com   부산시 중구  1999-01-30            7  7.0

In [249]:
import math

np.nan, None, math.nan  # 결측치 : 기본적으로 실수형

(nan, None, nan)

In [217]:
# 결측치는 정수형으로 변환 불가 (결측치 대체 후 형변환)

# member['fn'].astype('int')

In [268]:
# 데이터프레임에 열 추가 방법 3 : 시리즈로 추가 (데이터 갯수가 부족하면 나머지는 결측치)

member = pd.read_csv('data/ch11_member.csv', comment='#')
member['fn2'] = pd.Series([7, 7, 7])
member

  Name  Age          Email  Address       Birth  fn2
0  홍길동   20  hong@hong.com  서울시 강동구  1999-01-01  7.0
1  홍길서   30   seo@hong.com   서울시 중구  1999-12-01  7.0
2  홍길남   21   nam@hong.com  서울시 강동구  1999-11-01  7.0
3  홍길북   22   buk@hong.com  서울시 관악구  1999-05-01  NaN
4  홍길중   23   mid@hong.com   부산시 중구  1999-01-30  NaN

In [269]:
member['fn'] = pd.Series(['test', 'test1', 'test2'], index = [0, 3, 4])
member

  Name  Age          Email  Address       Birth  fn2     fn
0  홍길동   20  hong@hong.com  서울시 강동구  1999-01-01  7.0   test
1  홍길서   30   seo@hong.com   서울시 중구  1999-12-01  7.0    NaN
2  홍길남   21   nam@hong.com  서울시 강동구  1999-11-01  7.0    NaN
3  홍길북   22   buk@hong.com  서울시 관악구  1999-05-01  NaN  test1
4  홍길중   23   mid@hong.com   부산시 중구  1999-01-30  NaN  test2

In [270]:
member.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5 entries, 0 to 4
Data columns (total 7 columns):
 #   Column   Non-Null Count  Dtype
---  ------   --------------  -----
 0   Name     5 non-null      object
 1   Age      5 non-null      int64
 2   Email    5 non-null      object
 3   Address  5 non-null      object
 4   Birth    5 non-null      object
 5   fn2      3 non-null      float64
 6   fn       3 non-null      object
dtypes: float64(1), int64(1), object(5)
memory usage: 408.0+ bytes

In [271]:
# 행 추가시 추가할 데이터를 데이터프레임 → 기존 DF, 추가할 DF 연결

member = pd.read_csv('data/ch11_member.csv')
new_member = pd.DataFrame([{
    'Name':'홀길숙',
    'Age' : 30,
    'Email':'h@h.com',
    'Address':'설',
    'Birth':'2010-01-01'
}])
new_member

  Name  Age    Email Address       Birth
0  홀길숙   30  h@h.com       설  2010-01-01

In [272]:
# 행 추가시 member와 new_member 연결

member = pd.concat([member, new_member])
member

   Name  Age          Email  Address       Birth
0   홍길동   20  hong@hong.com  서울시 강동구  1999-01-01
1   홍길서   30   seo@hong.com   서울시 중구  1999-12-01
2   홍길남   21   nam@hong.com  서울시 강동구  1999-11-01
3   홍길북   22   buk@hong.com  서울시 관악구  1999-05-01
4   홍길중   23   mid@hong.com   부산시 중구  1999-01-30
5  #홍길뜽   24    non@not.com      없는구  2000-01-01
0   홀길숙   30        h@h.com        설  2010-01-01

In [273]:
pd.concat([member, new_member], axis = 1 )  # axis = 0 : 기본값 (행열결)
                                         # axis = 1 : 열연결

,Name,Age,Email,Address,Birth,Name,Age,Email,Address,Birth
0,홍길동,20,hong@hong.com,서울시 강동구,1999-01-01,홀길숙,30.0,h@h.com,설,2010-01-01
1,홍길서,30,seo@hong.com,서울시 중구,1999-12-01,NaN,NaN,NaN,NaN,NaN
2,홍길남,21,nam@hong.com,서울시 강동구,1999-11-01,NaN,NaN,NaN,NaN,NaN
3,홍길북,22,buk@hong.com,서울시 관악구,1999-05-01,NaN,NaN,NaN,NaN,NaN
4,홍길중,23,mid@hong.com,부산시 중구,1999-01-30,NaN,NaN,NaN,NaN,NaN
5,#홍길뜽,24,non@not.com,없는구,2000-01-01,NaN,NaN,NaN,NaN,NaN
0,홀길숙,30,h@h.com,설,2010-01-01,홀길숙,30.0,h@h.com,설,2010-01-01

In [274]:
# 인덱스 재조정

# member.index = range(len(member))
member.reset_index(drop = True)  # 기존의 index를 drop하고 새로운 연속된 index로 재조정
# member.reset_index() : 기존의 index를 컬럼에 편입시키고 새로운 연속된 index를 생성
member

   Name  Age          Email  Address       Birth
0   홍길동   20  hong@hong.com  서울시 강동구  1999-01-01
1   홍길서   30   seo@hong.com   서울시 중구  1999-12-01
2   홍길남   21   nam@hong.com  서울시 강동구  1999-11-01
3   홍길북   22   buk@hong.com  서울시 관악구  1999-05-01
4   홍길중   23   mid@hong.com   부산시 중구  1999-01-30
5  #홍길뜽   24    non@not.com      없는구  2000-01-01
0   홀길숙   30        h@h.com        설  2010-01-01

# 6절. 병합과 연결

## 6.1 merge()를 이용한 병합

In [241]:
df1 = pd.DataFrame({'key':['a', 'b', 'c', 'd'],
                    'c1':[1, 2, 3, 4]})
df2 = pd.DataFrame({'key':['a', 'b', 'c', 'e'],
                    'c2':[5, 6, 7, 8]})

display(df1)
display(df2)

  key  c1
0   a   1
1   b   2
2   c   3
3   d   4

  key  c2
0   a   5
1   b   6
2   c   7
3   e   8

In [242]:
df1.merge(df2)  # how = 'inner' (기본) : 양쪽 다 일치하는 데이터만 남김

  key  c1  c2
0   a   1   5
1   b   2   6
2   c   3   7

In [243]:
df1.merge(right = df2, how = 'left')  # left 데이터가 기준으로 right 데이터는 매칭되는 것만 병합

  key  c1   c2
0   a   1  5.0
1   b   2  6.0
2   c   3  7.0
3   d   4  NaN

In [244]:
df1.merge(right = df2, how = 'right')  # right 데이터가 기준으로 left 데이터는 매칭되는 것만 병합

  key   c1  c2
0   a  1.0   5
1   b  2.0   6
2   c  3.0   7
3   e  NaN   8

In [245]:
df1.merge(df2, how = 'outer') # 양쪽 데이터를 모두 남김

  key   c1   c2
0   a  1.0  5.0
1   b  2.0  6.0
2   c  3.0  7.0
3   d  4.0  NaN
4   e  NaN  8.0

In [276]:
df3 = pd.DataFrame({'key3':['a', 'b', 'c', 'd'],
                    'c3':[1, 2, 3, 4]})
df4 = pd.DataFrame({'key4':['a', 'b', 'c', 'e'],
                    'c4':[5, 6, 7, 8]})

display(df3)
display(df4)

  key3  c3
0    a   1
1    b   2
2    c   3
3    d   4

  key4  c4
0    a   5
1    b   6
2    c   7
3    e   8

In [277]:
df3.merge(right = df4, left_on = 'key3', right_on = 'key4', how = 'inner')

  key3  c3 key4  c4
0    a   1    a   5
1    b   2    b   6
2    c   3    c   7

In [278]:
df3.merge(right = df4, left_on = 'key3', right_on = 'key4', how = 'outer')

  key3   c3 key4   c4
0    a  1.0    a  5.0
1    b  2.0    b  6.0
2    c  3.0    c  7.0
3    d  4.0  NaN  NaN
4  NaN  NaN    e  8.0

In [279]:
df3.merge(df4, left_index = True, right_index = True)  # pd.concat([df3, df4],1)이랑 유사

  key3  c3 key4  c4
0    a   1    a   5
1    b   2    b   6
2    c   3    c   7
3    d   4    e   8

## 6.2 concat()을 이용한 연결

- pd.concat([df1, df2], axis)
    * axis = 0 (기본값) : 위아래로 연결
    * axis = 1 : 좌우로 연결

In [280]:
df1 = pd.DataFrame({'key':['a','b','c','d'],
                    'c1':[1, 2, 3, 4]})
df2 = pd.DataFrame({'key':['a','b','c','e'],
                    'c1':[5, 6, 7, 8]})

# 위아래로 연결

pd.concat([df1, df2], axis = 0).reset_index(drop = True)

  key  c1
0   a   1
1   b   2
2   c   3
3   d   4
4   a   5
5   b   6
6   c   7
7   e   8

In [283]:
df3 = pd.DataFrame({'key3':['a', 'b', 'c', 'd'],
                    'c3':[1, 2, 3, 4]})
df4 = pd.DataFrame({'key4':['a', 'b', 'c', 'e'],
                    'c4':[5, 6, 7, 8]})

# 좌우로 연결

pd.concat([df3, df4], axis = 1).reset_index(drop = True)

  key3  c3 key4  c4
0    a   1    a   5
1    b   2    b   6
2    c   3    c   7
3    d   4    e   8

# 7절. 정렬 (행이름, 열이름, 값에 의한 정렬)

- df.sort_index(axis) : 행(axis = 0) 또는 열(axis = 1) 이름으로 정렬
- df.sort_values(by = 정렬기준이 될 열이름, acending = True/False, inplace = True/False) : 값에 의한 정렬

In [284]:
member = pd.read_csv('data/ch11_member.csv', comment = '#')
member.index = ['동', '서', '남', '북', '중']
member

  Name  Age          Email  Address       Birth
동  홍길동   20  hong@hong.com  서울시 강동구  1999-01-01
서  홍길서   30   seo@hong.com   서울시 중구  1999-12-01
남  홍길남   21   nam@hong.com  서울시 강동구  1999-11-01
북  홍길북   22   buk@hong.com  서울시 관악구  1999-05-01
중  홍길중   23   mid@hong.com   부산시 중구  1999-01-30

## 7.1 행이름으로 정렬

In [286]:
member.sort_index(axis = 0)
member.sort_index(axis = 'rows', inplace = True)  # ascending = True 기본값
member

  Name  Age          Email  Address       Birth
남  홍길남   21   nam@hong.com  서울시 강동구  1999-11-01
동  홍길동   20  hong@hong.com  서울시 강동구  1999-01-01
북  홍길북   22   buk@hong.com  서울시 관악구  1999-05-01
서  홍길서   30   seo@hong.com   서울시 중구  1999-12-01
중  홍길중   23   mid@hong.com   부산시 중구  1999-01-30

## 7.2 열이름으로 정렬

In [287]:
member.sort_index(axis = 1)
member.sort_index(axis = 'columns', inplace = True)  # ascending = True 기본값
member

   Address  Age       Birth          Email Name
남  서울시 강동구   21  1999-11-01   nam@hong.com  홍길남
동  서울시 강동구   20  1999-01-01  hong@hong.com  홍길동
북  서울시 관악구   22  1999-05-01   buk@hong.com  홍길북
서   서울시 중구   30  1999-12-01   seo@hong.com  홍길서
중   부산시 중구   23  1999-01-30   mid@hong.com  홍길중

## 7.3 값에 의한 정렬

In [289]:
member.sort_values(by = 'Age')  # 'Age'열 데이터 기준으로 오름차순 정렬 ← ascending = True가 기본값

   Address  Age       Birth          Email Name
동  서울시 강동구   20  1999-01-01  hong@hong.com  홍길동
남  서울시 강동구   21  1999-11-01   nam@hong.com  홍길남
북  서울시 관악구   22  1999-05-01   buk@hong.com  홍길북
중   부산시 중구   23  1999-01-30   mid@hong.com  홍길중
서   서울시 중구   30  1999-12-01   seo@hong.com  홍길서

In [292]:
member.sort_values(by = 'Age', ascending = False, inplace = True)  # 'Age'열 데이터 기준으로 내림차순 정렬
member

   Address  Age       Birth          Email Name
서   서울시 중구   30  1999-12-01   seo@hong.com  홍길서
중   부산시 중구   23  1999-01-30   mid@hong.com  홍길중
북  서울시 관악구   22  1999-05-01   buk@hong.com  홍길북
남  서울시 강동구   21  1999-11-01   nam@hong.com  홍길남
동  서울시 강동구   20  1999-01-01  hong@hong.com  홍길동

In [293]:
# 'Address'기준으로 오름차순 정렬, 'Address'가 같으면 'Age'가 다음 기준, 'Age'도 같으면 'Email'이 그 다음 기준 → 모두 오름차순

member.sort_values(by = ['Address', 'Age', 'Email'])

   Address  Age       Birth          Email Name
중   부산시 중구   23  1999-01-30   mid@hong.com  홍길중
동  서울시 강동구   20  1999-01-01  hong@hong.com  홍길동
남  서울시 강동구   21  1999-11-01   nam@hong.com  홍길남
북  서울시 관악구   22  1999-05-01   buk@hong.com  홍길북
서   서울시 중구   30  1999-12-01   seo@hong.com  홍길서

In [294]:
# 'Address'기준으로 오름차순 정렬, 'Address'가 같으면 'Age'가 다음 기준으로 내림차순

member.sort_values(by = ['Address', 'Age'], 
                   ascending = [True, False], 
                   inplace = True)
member

   Address  Age       Birth          Email Name
중   부산시 중구   23  1999-01-30   mid@hong.com  홍길중
남  서울시 강동구   21  1999-11-01   nam@hong.com  홍길남
동  서울시 강동구   20  1999-01-01  hong@hong.com  홍길동
북  서울시 관악구   22  1999-05-01   buk@hong.com  홍길북
서   서울시 중구   30  1999-12-01   seo@hong.com  홍길서

In [300]:
# iris 데이터 셋

import seaborn as sns

iris = sns.load_dataset('iris')
iris

     sepal_length  sepal_width  petal_length  petal_width    species
0             5.1          3.5           1.4          0.2     setosa
1             4.9          3.0           1.4          0.2     setosa
2             4.7          3.2           1.3          0.2     setosa
3             4.6          3.1           1.5          0.2     setosa
4             5.0          3.6           1.4          0.2     setosa
..            ...          ...           ...          ...        ...
145           6.7          3.0           5.2          2.3  virginica
146           6.3          2.5           5.0          1.9  virginica
147           6.5          3.0           5.2          2.0  virginica
148           6.2          3.4           5.4          2.3  virginica
149           5.9          3.0           5.1          1.8  virginica

[150 rows x 5 columns]

In [308]:
# (1) sepal_length값 기준, sepal_width값이 다음 기준 둘 다 내림차순으로 정렬 (iris에 적용)

iris.sort_values(by = ['sepal_length', 'sepal_width'],
                 ascending = False,
                 inplace = True)
iris

     sepal_length  sepal_width  petal_length  petal_width    species
131           7.9          3.8           6.4          2.0  virginica
117           7.7          3.8           6.7          2.2  virginica
135           7.7          3.0           6.1          2.3  virginica
122           7.7          2.8           6.7          2.0  virginica
118           7.7          2.6           6.9          2.3  virginica
..            ...          ...           ...          ...        ...
41            4.5          2.3           1.3          0.3     setosa
42            4.4          3.2           1.3          0.2     setosa
38            4.4          3.0           1.3          0.2     setosa
8             4.4          2.9           1.4          0.2     setosa
13            4.3          3.0           1.1          0.1     setosa

[150 rows x 5 columns]

In [309]:
# (2) 행이름(index) 기준 정렬 (iris에 적용)

iris.sort_index(inplace = True)
iris

     sepal_length  sepal_width  petal_length  petal_width    species
0             5.1          3.5           1.4          0.2     setosa
1             4.9          3.0           1.4          0.2     setosa
2             4.7          3.2           1.3          0.2     setosa
3             4.6          3.1           1.5          0.2     setosa
4             5.0          3.6           1.4          0.2     setosa
..            ...          ...           ...          ...        ...
145           6.7          3.0           5.2          2.3  virginica
146           6.3          2.5           5.0          1.9  virginica
147           6.5          3.0           5.2          2.0  virginica
148           6.2          3.4           5.4          2.3  virginica
149           5.9          3.0           5.1          1.8  virginica

[150 rows x 5 columns]

In [310]:
# (3) 열이름(column) 기준 정렬한 내용을 출력 (iris에 적용 X)

iris.sort_index(axis = 1)

     petal_length  petal_width  sepal_length  sepal_width    species
0             1.4          0.2           5.1          3.5     setosa
1             1.4          0.2           4.9          3.0     setosa
2             1.3          0.2           4.7          3.2     setosa
3             1.5          0.2           4.6          3.1     setosa
4             1.4          0.2           5.0          3.6     setosa
..            ...          ...           ...          ...        ...
145           5.2          2.3           6.7          3.0  virginica
146           5.0          1.9           6.3          2.5  virginica
147           5.2          2.0           6.5          3.0  virginica
148           5.4          2.3           6.2          3.4  virginica
149           5.1          1.8           5.9          3.0  virginica

[150 rows x 5 columns]